# Pandas 
Pandas is like Excel in python, it uses tables (namely DataFrame) and operates transformations on the data. But it can do a lot more.

In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv("../nyc-rolling-sales-mandiri.csv")

In [6]:
# jumlah baris
len(df)

84548

In [7]:
# Dimensi
df.shape

(84548, 22)

In [12]:
df.head()

,Unnamed: 0,BOROUGH,NEIGHBORHOOD,BUILDING CLASS CATEGORY,TAX CLASS AT PRESENT,BLOCK,LOT,EASE-MENT,BUILDING CLASS AT PRESENT,ADDRESS,APARTMENT NUMBER,ZIP CODE,RESIDENTIAL UNITS,COMMERCIAL UNITS,TOTAL UNITS,LAND SQUARE FEET,GROSS SQUARE FEET,YEAR BUILT,TAX CLASS AT TIME OF SALE,BUILDING CLASS AT TIME OF SALE,SALE PRICE,SALE DATE
0,4,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,,C2,153 AVENUE B,,10009,5,0,5,1633,6440,1900,2,C2,6625000,2017-07-19 00:00:00
1,5,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,26,,C7,234 EAST 4TH STREET,,10009,28,3,31,4616,18690,1900,2,C7,-,2016-12-14 00:00:00
2,6,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,39,,C7,197 EAST 3RD STREET,,10009,16,1,17,2212,7803,1900,2,C7,-,2016-12-09 00:00:00
3,7,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21,,C4,154 EAST 7TH STREET,,10009,10,0,10,2272,6794,1913,2,C4,3936272,2016-09-23 00:00:00
4,8,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55,,C2,301 EAST 10TH STREET,,10009,6,0,6,2369,4615,1900,2,C2,8000000,2016-11-17 00:00:00

In [13]:
# pd.set_option("display.max.columns", None)
pd.set_option("display.precision", 2)

In [14]:
df.tail()

,Unnamed: 0,BOROUGH,NEIGHBORHOOD,BUILDING CLASS CATEGORY,TAX CLASS AT PRESENT,BLOCK,LOT,EASE-MENT,BUILDING CLASS AT PRESENT,ADDRESS,APARTMENT NUMBER,ZIP CODE,RESIDENTIAL UNITS,COMMERCIAL UNITS,TOTAL UNITS,LAND SQUARE FEET,GROSS SQUARE FEET,YEAR BUILT,TAX CLASS AT TIME OF SALE,BUILDING CLASS AT TIME OF SALE,SALE PRICE,SALE DATE
84543,8409,5,WOODROW,02 TWO FAMILY DWELLINGS,1,7349,34,,B9,37 QUAIL LANE,,10309,2,0,2,2400,2575,1998,1,B9,450000,2016-11-28 00:00:00
84544,8410,5,WOODROW,02 TWO FAMILY DWELLINGS,1,7349,78,,B9,32 PHEASANT LANE,,10309,2,0,2,2498,2377,1998,1,B9,550000,2017-04-21 00:00:00
84545,8411,5,WOODROW,02 TWO FAMILY DWELLINGS,1,7351,60,,B2,49 PITNEY AVENUE,,10309,2,0,2,4000,1496,1925,1,B2,460000,2017-07-05 00:00:00
84546,8412,5,WOODROW,22 STORE BUILDINGS,4,7100,28,,K6,2730 ARTHUR KILL ROAD,,10309,0,7,7,208033,64117,2001,4,K6,11693337,2016-12-21 00:00:00
84547,8413,5,WOODROW,35 INDOOR PUBLIC AND CULTURAL FACILITIES,4,7105,679,,P9,155 CLAY PIT ROAD,,10309,0,1,1,10796,2400,2006,4,P9,69300,2016-10-27 00:00:00

In [15]:
df.tail(3)

,Unnamed: 0,BOROUGH,NEIGHBORHOOD,BUILDING CLASS CATEGORY,TAX CLASS AT PRESENT,BLOCK,LOT,EASE-MENT,BUILDING CLASS AT PRESENT,ADDRESS,APARTMENT NUMBER,ZIP CODE,RESIDENTIAL UNITS,COMMERCIAL UNITS,TOTAL UNITS,LAND SQUARE FEET,GROSS SQUARE FEET,YEAR BUILT,TAX CLASS AT TIME OF SALE,BUILDING CLASS AT TIME OF SALE,SALE PRICE,SALE DATE
84545,8411,5,WOODROW,02 TWO FAMILY DWELLINGS,1,7351,60,,B2,49 PITNEY AVENUE,,10309,2,0,2,4000,1496,1925,1,B2,460000,2017-07-05 00:00:00
84546,8412,5,WOODROW,22 STORE BUILDINGS,4,7100,28,,K6,2730 ARTHUR KILL ROAD,,10309,0,7,7,208033,64117,2001,4,K6,11693337,2016-12-21 00:00:00
84547,8413,5,WOODROW,35 INDOOR PUBLIC AND CULTURAL FACILITIES,4,7105,679,,P9,155 CLAY PIT ROAD,,10309,0,1,1,10796,2400,2006,4,P9,69300,2016-10-27 00:00:00

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84548 entries, 0 to 84547
Data columns (total 22 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Unnamed: 0                      84548 non-null  int64
 1   BOROUGH                         84548 non-null  int64
 2   NEIGHBORHOOD                    84548 non-null  object
 3   BUILDING CLASS CATEGORY         84548 non-null  object
 4   TAX CLASS AT PRESENT            84548 non-null  object
 5   BLOCK                           84548 non-null  int64
 6   LOT                             84548 non-null  int64
 7   EASE-MENT                       84548 non-null  object
 8   BUILDING CLASS AT PRESENT       84548 non-null  object
 9   ADDRESS                         84548 non-null  object
 10  APARTMENT NUMBER                84548 non-null  object
 11  ZIP CODE                        84548 non-null  int64
 12  RESIDENTIAL UNITS               84548 non-null  int64
 13  COMMERCIAL UNITS                84548 non-null  int64
 14  TOTAL UNITS                     84548 non-null  int64
 15  LAND SQUARE FEET                84548 non-null  object
 16  GROSS SQUARE FEET               84548 non-null  object
 17  YEAR BUILT                      84548 non-null  int64
 18  TAX CLASS AT TIME OF SALE       84548 non-null  int64
 19  BUILDING CLASS AT TIME OF SALE  84548 non-null  object
 20  SALE PRICE                      84548 non-null  object
 21  SALE DATE                       84548 non-null  object
dtypes: int64(10), object(12)
memory usage: 14.2+ MB

In [17]:
df.describe()

,Unnamed: 0,BOROUGH,BLOCK,LOT,ZIP CODE,RESIDENTIAL UNITS,COMMERCIAL UNITS,TOTAL UNITS,YEAR BUILT,TAX CLASS AT TIME OF SALE
count,84548.00,84548.00,84548.00,84548.00,84548.00,84548.00,84548.00,84548.00,84548.00,84548.00
mean,10344.36,3.00,4237.22,376.22,10731.99,2.03,0.19,2.25,1789.32,1.66
std,7151.78,1.29,3568.26,658.14,1290.88,16.72,8.71,18.97,537.34,0.82
min,4.00,1.00,1.00,1.00,0.00,0.00,0.00,0.00,0.00,1.00
25%,4231.00,2.00,1322.75,22.00,10305.00,0.00,0.00,1.00,1920.00,1.00
50%,8942.00,3.00,3311.00,50.00,11209.00,1.00,0.00,1.00,1940.00,2.00
75%,15987.25,4.00,6281.00,1001.00,11357.00,2.00,0.00,2.00,1965.00,2.00
max,26739.00,5.00,16322.00,9106.00,11694.00,1844.00,2261.00,2261.00,2017.00,4.00

## Exploring Dataset

In [18]:
df["BOROUGH"].value_counts()

4    26736
3    24047
1    18306
5     8410
2     7049
Name: BOROUGH, dtype: int64

In [20]:
df["ZIP CODE"].value_counts()

10314    1687
11354    1384
11201    1324
11235    1312
11234    1165
         ...
10105       5
11430       1
10281       1
10803       1
10167       1
Name: ZIP CODE, Length: 186, dtype: int64

In [28]:
df.loc[df["ZIP CODE"] == 11234, "YEAR BUILT"].min()

0

In [27]:
df.loc[df["ZIP CODE"] == 11234, "YEAR BUILT"].max()

2016

### Pandas Series
Mirip list python

Object series punya dua komponen
* .values
* identifiers, which is the .index

In [29]:
revenues = pd.Series([5555, 7000, 18900])

In [36]:
# Seperti list python
revenues.values

array([ 5555,  7000, 18900], dtype=int64)

In [33]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [43]:
# Seperti dictionary python

# Set index
city_revenues = pd.Series(
    [4200, 8000, 4800],
    index=["Banda Aceh", "Langsa", "Lhokseumawe"]
)
city_revenues

Banda Aceh     4200
Langsa         8000
Lhokseumawe    4800
dtype: int64

In [44]:
value_city = pd.Series({"Banda Aceh":6, "Langsa":7, "Lhokseumawe":9})
value_city

Banda Aceh     6
Langsa         7
Lhokseumawe    9
dtype: int64

In [47]:
# Bentuk penulisan lain
kecamatan = pd.Series({"Langkahan":6, "Seunudon":7, "Meurah Meulia":9})
kecamatan

Langkahan        6
Seunudon         7
Meurah Meulia    9
dtype: int64

In [39]:
"tokyo" in kecamatan

False

In [40]:
"Langkahan" in kecamatan

True

### Pandas DataFrame

In [50]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "Value count": value_city,
})
city_data

             revenue  Value count
Banda Aceh      4200            6
Langsa          8000            7
Lhokseumawe     4800            9

In [49]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "Value count": value_city,
    "Kecamatan": kecamatan
})
city_data

               revenue  Value count  Kecamatan
Banda Aceh      4200.0          6.0        NaN
Langkahan          NaN          NaN        6.0
Langsa          8000.0          7.0        NaN
Lhokseumawe     4800.0          9.0        NaN
Meurah Meulia      NaN          NaN        9.0
Seunudon           NaN          NaN        7.0

In [51]:
city_data.index

Index(['Banda Aceh', 'Langsa', 'Lhokseumawe'], dtype='object')

In [52]:
city_data.values

array([[4200,    6],
       [8000,    7],
       [4800,    9]], dtype=int64)

In [53]:
# Index baris
city_data.axes[0]

Index(['Banda Aceh', 'Langsa', 'Lhokseumawe'], dtype='object')

In [54]:
# Index kolom
city_data.axes[1]

Index(['revenue', 'Value count'], dtype='object')

In [55]:
city_data.keys()

Index(['revenue', 'Value count'], dtype='object')

In [56]:
df.index

RangeIndex(start=0, stop=84548, step=1)

In [60]:
df.axes

[RangeIndex(start=0, stop=84548, step=1),
 Index(['Unnamed: 0', 'BOROUGH', 'NEIGHBORHOOD', 'BUILDING CLASS CATEGORY',
        'TAX CLASS AT PRESENT', 'BLOCK', 'LOT', 'EASE-MENT',
        'BUILDING CLASS AT PRESENT', 'ADDRESS', 'APARTMENT NUMBER', 'ZIP CODE',
        'RESIDENTIAL UNITS', 'COMMERCIAL UNITS', 'TOTAL UNITS',
        'LAND SQUARE FEET', 'GROSS SQUARE FEET', 'YEAR BUILT',
        'TAX CLASS AT TIME OF SALE', 'BUILDING CLASS AT TIME OF SALE',
        'SALE PRICE', 'SALE DATE'],
       dtype='object')]

In [62]:
84548 in df.keys()

False

In [64]:
"BLOCK" in df.keys()

True

### .loc dan .iloc
Pengindexan berdasarkan posisi (dimulai oleh angka 1)

In [68]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1,2,3,4,8])
colors

1       red
2    purple
3      blue
4     green
8    yellow
dtype: object

In [72]:
print(colors[1])
print(colors[8])

red
yellow

In [73]:
colors.loc[1] #label yang diberikan

'red'

In [75]:
colors.iloc[1] #indeks

'purple'

In [79]:
# iloc tidak mengembalikan elemen penutup
colors.iloc[1:4]

2    purple
3      blue
4     green
dtype: object

In [78]:
# iloc mengembalikan elemen penutup
colors.loc[1:4]

1       red
2    purple
3      blue
4     green
dtype: object

* .iloc similar to using [ ] on a list
* loc similar to using [ ] on s dictionary

In [82]:
city_data

             revenue  Value count
Banda Aceh      4200            6
Langsa          8000            7
Lhokseumawe     4800            9

In [83]:
city_data['revenue']

Banda Aceh     4200
Langsa         8000
Lhokseumawe    4800
Name: revenue, dtype: int64

In [84]:
# Jika nama kolom adalah string, kita dapang mengakses atribut dengan dot notation
city_data.revenue

Banda Aceh     4200
Langsa         8000
Lhokseumawe    4800
Name: revenue, dtype: int64

toys = pd.DataFrame([
    {"name": "ball", "shape": "sphere"},
    {"name": "Rubik's cube", "shape":"cube"}
])
toys

In [89]:
toys["shape"]

0    sphere
1      cube
Name: shape, dtype: object

In [88]:
toys.shape

(2, 2)

Nama kolom diatas adalah sama dengan attribut dataframe, sehingga kadang akan menimbulkan kesalahan. Sehingga untuk melakukan pengindexan gaya atribut lebih berhati-hati

In [92]:
city_data.loc["Langsa"]

revenue        8000
Value count       7
Name: Langsa, dtype: int64

In [97]:
city_data.loc["Langsa": "Lhokseumawe"]

             revenue  Value count
Langsa          8000            7
Lhokseumawe     4800            9

In [98]:
city_data

             revenue  Value count
Banda Aceh      4200            6
Langsa          8000            7
Lhokseumawe     4800            9

In [105]:
df.iloc[-2]

Unnamed: 0                                                               8412
BOROUGH                                                                     5
NEIGHBORHOOD                                                          WOODROW
BUILDING CLASS CATEGORY           22 STORE BUILDINGS
TAX CLASS AT PRESENT                                                        4
BLOCK                                                                    7100
LOT                                                                        28
EASE-MENT
BUILDING CLASS AT PRESENT                                                  K6
ADDRESS                                                 2730 ARTHUR KILL ROAD
APARTMENT NUMBER
ZIP CODE                                                                10309
RESIDENTIAL UNITS                                                           0
COMMERCIAL UNITS                                                            7
TOTAL UNITS                                                                 7
LAND SQUARE FEET                                                       208033
GROSS SQUARE FEET                                                       64117
YEAR BUILT                                                               2001
TAX CLASS AT TIME OF SALE                                                   4
BUILDING CLASS AT TIME OF SALE                                             K6
SALE PRICE                                                           11693337
SALE DATE                                                 2016-12-21 00:00:00
Name: 84546, dtype: object

In [109]:
city_data.loc["Langsa": "Lhokseumawe", "revenue"]

Langsa         8000
Lhokseumawe    4800
Name: revenue, dtype: int64

In [121]:
df.loc[12:1222, ["BOROUGH", "ADDRESS", "YEAR BUILT"]]

      BOROUGH                  ADDRESS  YEAR BUILT
12          1    327 EAST 3 STREET, 1C        1920
13          1    327 EAST 3 STREET, 1C        1920
14          1    327 EAST 3 STREET, 3A        1920
15          1  327 EAST 3RD STREET, 5A        1920
16          1    327 EAST 3 STREET, 2E        1920
...       ...                      ...         ...
1218        1            30 PARK PLACE        2008
1219        1            30 PARK PLACE        2008
1220        1            30 PARK PLACE        2008
1221        1            30 PARK PLACE        2008
1222        1            30 PARK PLACE        2008

[1211 rows x 3 columns]

In [118]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84548 entries, 0 to 84547
Data columns (total 22 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Unnamed: 0                      84548 non-null  int64
 1   BOROUGH                         84548 non-null  int64
 2   NEIGHBORHOOD                    84548 non-null  object
 3   BUILDING CLASS CATEGORY         84548 non-null  object
 4   TAX CLASS AT PRESENT            84548 non-null  object
 5   BLOCK                           84548 non-null  int64
 6   LOT                             84548 non-null  int64
 7   EASE-MENT                       84548 non-null  object
 8   BUILDING CLASS AT PRESENT       84548 non-null  object
 9   ADDRESS                         84548 non-null  object
 10  APARTMENT NUMBER                84548 non-null  object
 11  ZIP CODE                        84548 non-null  int64
 12  RESIDENTIAL UNITS               84548 non-null  int64
 13  COMMERCIAL UNITS                84548 non-null  int64
 14  TOTAL UNITS                     84548 non-null  int64
 15  LAND SQUARE FEET                84548 non-null  object
 16  GROSS SQUARE FEET               84548 non-null  object
 17  YEAR BUILT                      84548 non-null  int64
 18  TAX CLASS AT TIME OF SALE       84548 non-null  int64
 19  BUILDING CLASS AT TIME OF SALE  84548 non-null  object
 20  SALE PRICE                      84548 non-null  object
 21  SALE DATE                       84548 non-null  object
dtypes: int64(10), object(12)
memory usage: 14.2+ MB

In [128]:
# Apartement yang dibangun setelah tahun 2010
after2010 = df[df["YEAR BUILT"]>2010]
after2010.shape

(4675, 22)

In [141]:
after2010_tanpa_null = after2010[after2010["EASE-MENT"].notnull()]
after2010_tanpa_null.shape

(4675, 22)

In [142]:
# Sintaks lain bisa pake notna
after2010_tanpa_null = after2010[after2010["NEIGHBORHOOD"].notna()]
after2010_tanpa_null.shape

(4675, 22)

In [151]:
ers = after2010[after2010["NEIGHBORHOOD"].str.endswith("CITY")]
ers.shape

(167, 22)

In [181]:
# startswith
ers = after2010[after2010["NEIGHBORHOOD"].str.endswith("WOODROW")]
ers.shape

(4, 22)

In [189]:
ers[(ers["BOROUGH"] == 5)].shape

(4, 22)

In [190]:
after2010[(after2010["BOROUGH"] == 5)].shape

(533, 22)

In [192]:
ini = df[(df["BOROUGH"] == 5)].shape
ini

(8410, 22)

### Grouping and Aggregating Your Data

In [195]:
city_revenues

Banda Aceh     4200
Langsa         8000
Lhokseumawe    4800
dtype: int64

In [196]:
city_revenues.sum()

17000

In [197]:
city_revenues.max()

8000

In [198]:
city_revenues.mean()

5666.666666666667

In [203]:
city_revenues.max()

8000

In [202]:
type(city_revenues)

pandas.core.series.Series

In [218]:
# Menghitung total unit untuk masing-masing wilayah
df.groupby("BOROUGH", sort=False)["TOTAL UNITS"].sum()

BOROUGH
1    48504
2    25403
3    53400
4    51841
5    11016
Name: TOTAL UNITS, dtype: int64

In [222]:
bagi = df[
    (df["BOROUGH"] == 5) &
    (df["YEAR BUILT"] == 2010)
]
bagi.shape

(20, 22)

In [229]:
bagi = df[
    (df["BOROUGH"] == 5) &
    (df["YEAR BUILT"] == 2010)
].groupby(["NEIGHBORHOOD", "TAX CLASS AT PRESENT"])["LOT"].count()

bagi

NEIGHBORHOOD       TAX CLASS AT PRESENT
ARDEN HEIGHTS      1A                      2
ARROCHAR           1                       2
CASTLETON CORNERS  1                       1
CONCORD            1                       1
                   1A                      1
DONGAN HILLS       1                       1
GREAT KILLS        1B                      1
MIDLAND BEACH      1                       1
PLEASANT PLAINS    1                       1
PORT RICHMOND      1                       1
PRINCES BAY        1                       1
ROSSVILLE          4                       1
SOUTH BEACH        1                       1
TRAVIS             4                       1
WEST NEW BRIGHTON  1                       1
WOODROW            1                       3
Name: LOT, dtype: int64

In [235]:
df.shape

(84548, 22)

In [230]:
copian = df.copy()

In [236]:
# Menambahkan kolom baru
copian["difference"] = df.BLOCK - df.LOT

In [234]:
copian.shape

(84548, 23)